{"file_hash":null,"name":"SteamNodes","version":"0.7.21","description":"A set of various nodes to implement a Dynamo workflow in every all-day job. contact: @jbenoit44","group":"","keywords":["steamnodes"],"dependencies":[],"license":"MIT","contents":"Analytical.CreateLineBoundaryCondition - Create Line Boundary Condition from Analytical Line, Analytical.CreateLineLoadBeta - beta 1, Element.Create 3D Cropped view - create 3d view for each element and crop view, Element.GetFromLinkedFile - Get elements from link document instance based on category, Element.MakeParts - Create parts from elements, Element.Parts.Getparents - Returns parents of selected Parts, Element.SelectInView - Select the input elements in active view, Element.TypeName - Get Type Name as string, List.FilterByString - Filter a list by a string match, List.Operations - List A-B / List Intersection / List symmetric difference, Schedule.GetCalculatedValues - Get Schedule Calculated Values from name input, Schedule.GetTextFromHeader - from Viewschedule input, returns columns header values as text, Tool.AddVoidCut - Add void cut for a Set of elements. In combination with Get surrounding elements node., Tool.CreateRoomAtPointAndLevel - create rooms from center points at Level, Tool.ElementsInGroup - returns elements from a given group, selected by his name, Tool.Eraser - Try to delete any element from project, Tool.EraserByName - erase things in a list, selected by the name, Tool.GetLineStyleByName - Collects LineStyle from string.contains, Tool.GetPhaseByName - Get Document Phases by String, Tool.GetRevitSelection - get the selection from the revit UI, works for views, Tool.GetSurroundingElements - Get Surrounding Elements by Categories, group them  as  List. Tolerance distance available., Tool.PlaceGroupAtPoint - place a given group at given points, Tool.RemoveVoidCut - Add void cut for a Set of elements. In combination with Get surrounding elements node., View.ApplyViewTemplate - Applies a view template to any given view(s). Supply a string with a view template name., Wall.GetTotalWidth - Get Wall's  Total Width parameter|ContainsPythonScripts(58B25C0B-CBBE-4DDC-AC39-ECBEB8B55B10)","engine_version":"0.7.2.13394","engine_metadata":"","engine":"dynamo"}